; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v4 - type_1 ?v3 - type_3)
 	      (pred_4 ?v7 - object ?v3 - type_3)
	      (pred_3 ?v4 - type_1 ?v5 - type_2)
	      (pred_2 ?v4 - type_1 ?v7 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v4 - type_1 ?v8 ?v6 - type_3)
       :precondition (and  (pred_1 ?v4 ?v8))
       :effect (and  (pred_1 ?v4 ?v6)
		     (not (pred_1 ?v4 ?v8))))

   (:action op_1
       :parameters (?v4 - type_1 ?v2 - object ?v1 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v1) (pred_1 ?v4 ?v1) (pred_3 ?v4 ?v5))
       :effect (and (pred_2 ?v4 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v1)) 
		    (not (pred_3 ?v4 ?v5))))

   (:action op_3
       :parameters (?v4 - type_1 ?v2 - object ?v1 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v2 ?v5) (pred_1 ?v4 ?v1))
       :effect (and (pred_4 ?v2 ?v1)
		    (pred_3 ?v4 ?v5)
		    (not (pred_2 ?v4 ?v2 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_08 - type_1
obj_12 obj_01 obj_02 obj_06 - type_2
obj_13 obj_10 obj_04 obj_03 - type_3
obj_09 obj_07 obj_14 obj_05 - object)
(:init
(pred_1 obj_11 obj_13)
(pred_3 obj_11 obj_12)
(pred_3 obj_11 obj_01)
(pred_1 obj_08 obj_10)
(pred_3 obj_08 obj_02)
(pred_3 obj_08 obj_06)
(pred_4 obj_09 obj_04)
(pred_4 obj_07 obj_04)
(pred_4 obj_14 obj_10)
(pred_4 obj_05 obj_04)
)
(:goal
(and
(pred_4 obj_09 obj_03)
(pred_4 obj_07 obj_13)
(pred_4 obj_14 obj_04)
(pred_4 obj_05 obj_10)
)
)

(:constraints
  (always (not (pred_1 obj_11 obj_04)))
)
)

; plan
1. (op_2 obj_11 obj_13 obj_10)
   deleted: (pred_1 obj_11 obj_13)
   added: (pred_1 obj_11 obj_10)
   goals met: 0 of 4
2. (op_1 obj_08 obj_14 obj_10 obj_06)
   deleted: (pred_4 obj_14 obj_10) (pred_3 obj_08 obj_06)
   added: (pred_2 obj_08 obj_14 obj_06)
   goals met: 0 of 4
3. (op_2 obj_08 obj_10 obj_04)
   deleted: (pred_1 obj_08 obj_10)
   added: (pred_1 obj_08 obj_04)
   goals met: 0 of 4
4. (op_3 obj_08 obj_14 obj_04 obj_06)
   deleted: (pred_2 obj_08 obj_14 obj_06)
   added: (pred_4 obj_14 obj_04) (pred_3 obj_08 obj_06)
   goals met: 1 of 4
5. (op_1 obj_08 obj_07 obj_04 obj_02)
   deleted: (pred_4 obj_07 obj_04) (pred_3 obj_08 obj_02)
   added: (pred_2 obj_08 obj_07 obj_02)
   goals met: 1 of 4
6. (op_2 obj_08 obj_04 obj_13)
   deleted: (pred_1 obj_08 obj_04)
   added: (pred_1 obj_08 obj_13)
   goals met: 1 of 4
7. (op_3 obj_08 obj_07 obj_13 obj_02)
   deleted: (pred_2 obj_08 obj_07 obj_02)
   added: (pred_4 obj_07 obj_13) (pred_3 obj_08 obj_02)
   goals met: 2 of 4
8. (op_2 obj_08 obj_13 obj_04)
   deleted: (pred_1 obj_08 obj_13)
   added: (pred_1 obj_08 obj_04)
   goals met: 2 of 4
9. (op_1 obj_08 obj_09 obj_04 obj_06)
   deleted: (pred_4 obj_09 obj_04) (pred_3 obj_08 obj_06)
   added: (pred_2 obj_08 obj_09 obj_06)
   goals met: 2 of 4
10. (op_2 obj_08 obj_04 obj_03)
   deleted: (pred_1 obj_08 obj_04)
   added: (pred_1 obj_08 obj_03)
   goals met: 2 of 4
11. (op_3 obj_08 obj_09 obj_03 obj_06)
   deleted: (pred_2 obj_08 obj_09 obj_06)
   added: (pred_4 obj_09 obj_03) (pred_3 obj_08 obj_06)
   goals met: 3 of 4
12. (op_2 obj_08 obj_03 obj_04)
   deleted: (pred_1 obj_08 obj_03)
   added: (pred_1 obj_08 obj_04)
   goals met: 3 of 4
13. (op_1 obj_08 obj_05 obj_04 obj_06)
   deleted: (pred_4 obj_05 obj_04) (pred_3 obj_08 obj_06)
   added: (pred_2 obj_08 obj_05 obj_06)
   goals met: 3 of 4
14. (op_2 obj_08 obj_04 obj_10)
   deleted: (pred_1 obj_08 obj_04)
   added: (pred_1 obj_08 obj_10)
   goals met: 3 of 4
15. (op_3 obj_08 obj_05 obj_10 obj_06)
   deleted: (pred_2 obj_08 obj_05 obj_06)
   added: (pred_4 obj_05 obj_10) (pred_3 obj_08 obj_06)
   goals met: 4 of 4
